#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_ztest-multiple-member-4528.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=25acf703-a697-49d4-b1e3-5b3022b33774]
module.keycloak_dev.module.onestopauth.module.client_ztest-multiple-member-4528.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=078e9b26-2757-4397-83ce-f8cefd797feb]
module.keycloak_dev.module.onestopauth.module.client_ztest-multiple-member-4528.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=72e7d436-70c6-4162-bcbf-0b778639a808]
module.keycloak_dev.module.onestopauth.module.client_ztest-multiple-member-4528.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2fc38c98-dd18-4404-be91-b144c54f73de]
module.keycloak_dev.module.onestopauth.module.client_ztest-multiple-member-4528.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e95c87f3-5b85-4c13-a6fa-66486398cf1a]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_openid_client.this: Refreshing state... [id=d9ea1689-ab66-4bdd-82d6-19e31007b2b5]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2feb5617-2be9-483d-8ec0-04ecc6deff3f]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=aa1c86d7-f8aa-4714-9926-a58622d1d324]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=8f9958b3-f40b-48ae-815e-0fc0271b345b]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a1624ea6-ba03-4982-b59d-0f20423d7ed4]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dbfcfc06-816a-44e9-9729-bbb0dcbd3ac5]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9ff96311-ac47-4bbe-a054-71ab6f55c023]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=747dd4c8-c0a7-48cd-bcd4-d41e6f80e63e]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b736fc9f-a588-487c-a8d5-f9fedd1cf89f]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d00fe817-e89f-43b8-aeaa-4b3379ac0b29]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=140e35d9-4536-472a-a440-2abdd0822d11]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a5ceda21-fbcc-40e0-ab5d-97a08df2305f]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=afeb995f-a519-4f19-a10b-cde7e1a40803]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=1c9722ca-e1f1-4cd4-8e80-c55f3ef363da]
module.keycloak_dev.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=04fe619b-7246-4a95-a449-19a2d1f26746]
module.keycloak_dev.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=80d34657-7917-444a-9153-a6ddd84cc2da]
module.keycloak_dev.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3cec4da8-844c-4ca6-82c7-88a12f9f358e]
module.keycloak_dev.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5ad85904-0600-416b-8440-2dad61e3c18b]
module.keycloak_dev.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f30895ba-f722-4299-b4e5-df3d83f3a8b0]
module.keycloak_dev.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=58edf72e-a0f4-446e-8479-a43b7828a9f8]
module.keycloak_dev.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=488e3989-0e02-4ba1-aa6d-ca48f11c9fc5]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=31ce7dc9-f930-421f-a93e-86a0c0ead613]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=89161301-45c5-4d41-860a-7315549335a8]
module.keycloak_dev.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c8226787-b58b-499f-b0a6-d883fa768e0e]
module.keycloak_dev.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ae916d49-4606-4e9c-af45-71f98d8b57af]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c6ffacca-6e07-465c-a0f0-fca71212fb2b]
module.keycloak_dev.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=200efa40-594c-47c8-9a5d-a36c3764c67a]
module.keycloak_dev.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f824abd2-5a8e-44eb-9388-7b1793d789eb]
module.keycloak_dev.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3da82ce8-fc93-43ab-b2c2-ee962751fed4]
module.keycloak_dev.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1c162e94-e149-427b-8bf8-48d2afc9a818]
module.keycloak_dev.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=95782915-996a-4aaf-bd09-fa129b68b157]
module.keycloak_dev.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7efc0fe3-e80e-4025-87f1-93c7f180563c]
module.keycloak_dev.module.onestopauth.module.client_test-2-1388.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=223c6066-547b-43c4-9240-4d6eb404fec6]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=383fe8ea-de3a-4915-a52f-860fbf1bbe80]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b02dc5ec-a1b7-4c26-8e2f-2e41b8f3ffe4]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b29956ba-4dd8-43b6-990a-e2a81528b92d]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=75d8ac36-8156-47d3-b890-97682124dc7c]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=56200527-3909-4c02-b468-5f91156755fc]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e29049d5-4b73-4393-8317-3d6345954adb]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ef330158-03fc-4eab-8631-5e3297e13e43]
module.keycloak_dev.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f1540ffa-bb98-4d9e-bafd-c07e62702394]
module.keycloak_dev.module.onestopauth.module.client_testing-for-v-1-199.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5514c7ef-d293-4ea1-bbf6-c49a334bd192]
module.keycloak_dev.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=67a848fe-2f85-4d36-bb76-82587b02d7ea]
module.keycloak_dev.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8637574-76c6-4637-a211-4a4d2daaa8c4]
module.keycloak_dev.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=02a37045-a92e-4ad0-aaaa-ba0f2097e67d]
module.keycloak_dev.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=79075ae0-fe61-4df9-9ec2-822bd9d9c3b4]
module.keycloak_dev.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=2228805f-2eeb-46e3-bab8-d6093eab2911]
module.keycloak_dev.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9d3c86d3-8355-4372-b103-ff50be18b402]
module.keycloak_dev.module.onestopauth.module.client_test-sept-21-2113.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d77a3891-2485-41c6-89fe-1248b66dee4c]
module.keycloak_dev.module.onestopauth.module.client_123-3532.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=318be919-3068-4e8e-9dd6-ea9d693ab986]
module.keycloak_dev.module.onestopauth.module.client_123-3532.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1e4ba049-9676-4b74-9bdd-1017998516d0]
module.keycloak_dev.module.onestopauth.module.client_123-3532.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0ee28783-8137-4078-9b5b-7f48ffa74eed]
module.keycloak_dev.module.onestopauth.module.client_123-3532.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=60b40eec-6f42-4a6e-9da3-5cadcc6a51c8]
module.keycloak_dev.module.onestopauth.module.client_123-3532.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0b20f1ae-7cd2-4c82-b29a-19a595c7e7b3]
module.keycloak_dev.module.onestopauth.module.client_123-3532.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=bad85f8b-1172-4b45-ad94-4ae2b86b760b]
module.keycloak_dev.module.onestopauth.module.client_123-3532.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0ed923e7-f0ab-4404-97d9-21446ca5c257]
module.keycloak_dev.module.onestopauth.module.client_123-3532.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8e261e3c-dc6d-4fba-98a5-3562c01860ca]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=2fd1bff9-837d-4bb5-84ce-d67fe5865a67]
module.keycloak_dev.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8bfe71a2-2e0b-4757-8351-dbd8dfe5a5a9]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=74c7c7f9-e7af-41e3-8186-b3d5e5e80639]
module.keycloak_dev.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=bf7e5a27-314b-40c9-b268-097abc748999]
module.keycloak_dev.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d77e6e10-df00-4286-bf8e-2005de8276b7]
module.keycloak_dev.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b63e1133-991c-4f07-9c2e-9a2d18f64e03]
module.keycloak_dev.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=af0e9163-00e3-454a-8195-134bb2eb3d50]
module.keycloak_dev.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a9c28669-653f-4c27-8e9c-f31aa5bc36e9]
module.keycloak_dev.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a9d8b444-608a-4c53-80e1-f9c23747a2ec]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4a6406b5-4e77-491b-ab48-0839fb65c44a]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c912cdfa-fc24-440e-ae83-f9d26f34277b]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bd2afc16-a3a5-474a-8b47-2b30fbd6676f]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e2ffe2c8-b585-44a4-a875-bbcb78d492bf]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ddf77f5a-8101-4fca-aa54-6390449a7f03]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e5b5688e-2148-4497-a192-6a81b6808246]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=889affb6-1e3a-4390-ba71-b0e0846dae0d]
module.keycloak_dev.module.onestopauth.module.client_test-2080.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f99f1831-b9f4-4ee9-958d-0d109eaaf757]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=eceb3f1d-925d-46b6-8fd1-2ba30696184f]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=923bb5f0-6d5b-4be4-864c-8abe19e58ece]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=640fef22-af5a-4e81-bba5-0bad83d0893a]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3fb093c0-f7d1-4ba1-987e-363814f65908]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c0c370f9-04ad-4b39-9b29-af66bdbfff9d]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a3080342-cba8-493a-8c3a-198a6a586c55]
module.keycloak_dev.module.onestopauth.module.client_test-08-09-2021-199.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bd8c6ab7-d79f-4554-a338-24e81dc53946]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7f36873e-e532-4665-adfb-e67bef1bdfdd]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a486276e-2359-42aa-b7f5-624e9bbdaaac]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c0d6e389-c17c-4c6d-b1a2-4cf9d6049c6a]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=242f559a-5b9f-4351-abda-4aa1cd1ea96f]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b7c4055c-8f66-459f-94e4-cf51b597c772]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=656ea0c6-04d0-4953-a670-9482828b9b56]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d0511de3-2abf-4a75-a182-5f0659fc03f7]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=38b557d1-d3ab-4919-95f0-e922766301e4]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d5471293-c661-4e0b-a6f7-5520712c4392]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=932bf21e-23ce-4e42-aeb4-8e969da7b494]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4b967f55-1881-46ff-adf1-7758cf18f117]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=6684dfbc-c77c-4b1e-85c9-30feb120dfa4]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=9c1faec0-d6c9-4bb3-b766-ae4d92d41e35]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=43bc8afd-86c7-4c2c-9b94-cbb003453b05]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=09759bf8-3358-4486-ae66-3d85df55897c]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5252461f-7408-4c7c-9cbe-e7113410d43b]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d243f3d2-b703-439b-87a4-299305988476]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8684d849-1daf-4735-b4b3-3466e004ea06]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=da64e6e7-d02e-4a78-a638-bebc77c7784f]
module.keycloak_test.module.onestopauth_both.module.client_test-2641.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4a8d1a3f-9358-4408-8300-0088cecaf209]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=bbdbcc8e-16d6-48eb-888b-63de65755284]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a12ca869-b495-4d3e-8490-5e2b72efea7e]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=312aff52-9c00-490b-aeb6-04ebe8460643]
module.keycloak_test.module.onestopauth_business.module.client_bceidbasic-idir-devtestprod-3567.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=382ea598-aaf0-404d-8619-fe5f3a18a92a]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cd8fc724-320f-454f-b84a-b80913bca910]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e667cf59-6571-4ade-801b-e982726167b8]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=e12b99a3-70bb-45cc-934a-353bbe2a2621]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8f53305-a0bd-4217-8f99-f01f7ac449e9]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c05ff3c3-9d3c-4f63-9749-734267a00def]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3d76c8e8-1cc6-4ba3-8bc1-f10b2a0ddcb1]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=45578e11-c4be-4421-b4bf-1d0d52198a0d]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=376b14e1-332d-473f-87d2-6840780376e6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-2-4588.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "tians-testing-multiple-members-2-4588"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-2-4588.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-2-4588.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-2-4588.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-2-4588.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "tians-testing-multiple-members-2-4588"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-2-4588.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-2-4588.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-2-4588.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_tians-testing-multiple-members-2-4588.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "tians-testing-multiple-members-2-4588"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "tians-testing-multiple-members-2-4588"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://example",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-2-4588.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "tians-testing-multiple-members-2-4588"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-2-4588.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-2-4588.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-2-4588.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-2-4588.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "tians-testing-multiple-members-2-4588"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-2-4588.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-2-4588.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-2-4588.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_tians-testing-multiple-members-2-4588.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "tians-testing-multiple-members-2-4588"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "tians-testing-multiple-members-2-4588"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://example",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3357 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*